#include "kernel.h"

/************************************************************************
**	函数名称:	BeepOut(uint8_t N_100ms)
**	函数功能:	开关蜂鸣器
**	输入参数: N_100ms：蜂鸣器开或关的时间，100ms为单位计时，如传入参数为1，则蜂鸣器开或关100ms
**	返回值		：无

**	创 建 者:	YCX
**	创建日期:	2016-3-29 
*************************************************************************/
void BeepOut(uint8_t N_100ms)
{
    globalvar.BeepCount = N_100ms;

    if(N_100ms)
    {
        BEEP_ON();
    }
    else
    {
        BEEP_OFF();
    }
}

/************************************************************************
**	函数名称:	ValveInit(void)
**	函数功能:	关闭所有电磁阀及PLC联动信号
**	输入参数: 无
**	返回值		：无

**	创 建 者:	YCX
**	创建日期:	2018-9-10
*************************************************************************/
void ValveInit(void)
{
    /**** 电磁阀初始化 关闭全部电磁阀 ****/
    VCTRL_CLOSEKEY();
    VCTRL_LOW_CLOSE();
    VCTRL_MID_CLOSE();
    VCTRL_HIGH_CLOSE();
}

/************************************************************************
**	函数名称:	LedInit(void)
**	函数功能:	LED灯初始化
**	输入参数: 无
**	返回值		：无

**	创 建 者:	YCX
**	创建日期:	2018-9-10
*************************************************************************/
void LedInit(void)
{
    LED1_OUT();
    LED2_OUT();
    LED3_OUT();
}

